{
  "backend/main.mo": "Main Internet Computer actor implementing registration submission/lookup, admin-only record retrieval, CMS content management (hero, about, event details, coordinators, contact), and gallery image storage, with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report linking the AdminLogin page update (pre-populating admin email 'athiakash1977@gmail.com') to its implementation file and associated components/test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions summarizing each component or page's purpose and key features.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme design tokens (colors, radius, chart, sidebar variables).",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'National Level Project Expo 2026', mounting the app at `#root` and loading `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React app component configuring TanStack Router with hash-based history, all page routes, QueryClientProvider, and AdminAuthProvider.",
  "frontend/src/components/About.tsx": "About section component with IntersectionObserver-triggered staggered bounce-in animations on feature cards and two drifting background glow orbs, fetching content from the backend.",
  "frontend/src/components/AdminContentManagement.tsx": "CMS component with accordion-organized editable sections (Hero, About, Event Details, Coordinators, Contact) that fetch current backend content and provide save functionality via React Query mutations.",
  "frontend/src/components/Contact.tsx": "Renders the Contact section with animated cards showing address, phone, email, and website info fetched via a query hook, plus WhatsApp and Instagram social links.",
  "frontend/src/components/Coordinators.tsx": "Displays faculty and student coordinator cards with name, role, phone, and email, using intersection-observer-based scroll animations and data from a query hook.",
  "frontend/src/components/EventDetails.tsx": "Shows event details (date, venue, fee, eligibility, categories, timeline) in animated cards with data fetched via a query hook and fallback default content.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Fixed floating action buttons in the bottom-right corner linking to WhatsApp community and Instagram profile with hover tooltip labels.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, social links, quick navigation links, and a scroll-to-top button, styled with a dark green gradient theme.",
  "frontend/src/components/Hero.tsx": "Hero section featuring a typewriter text effect, live countdown timer to the event date, registration count stat, and parallax scroll effect, with content from query hooks.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll-aware styling, active link highlighting, and a collapsible mobile menu using TanStack Router links.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the admin login page using the AdminAuthContext.",
  "frontend/src/components/Registration.tsx": "Registration form component that collects participant details, submits them via a mutation hook, and displays a success modal with a registration ID and UPI payment info.",
  "frontend/src/components/ScrollProgressBar.tsx": "Fixed top progress bar that visually indicates scroll depth on the page using a green gradient.",
  "frontend/src/context/AdminAuthContext.tsx": "React context providing admin authentication state backed by sessionStorage, with login and logout functions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor (anonymous or authenticated) using the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication via DFINITY's AuthClient, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for reading and mutating backend data including registrations, admin verification, and CMS content (hero, about, event details, gallery, etc.).",
  "frontend/src/hooks/useScrollAnimation.ts": "Hook that uses IntersectionObserver to trigger fade-in or slide-up CSS animation classes when an element scrolls into view.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins/Inter fonts, sets up Tailwind, defines CSS custom properties for a dark green-themed design system, and declares all keyframe animations used throughout the app.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Standalone About page that composes Navbar, About section, Footer, floating social buttons, and a scroll progress bar.",
  "frontend/src/pages/AdminDashboard.tsx": "Protected admin dashboard with tabs for managing event registrations (search, delete, CSV export) and a gallery (upload, delete images), plus an analytics card and content management section.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that verifies credentials against the backend and redirects to the dashboard on success, restricting access to a single designated admin email.",
  "frontend/src/pages/EventDetailsPage.tsx": "Standalone Event Details page that wraps the EventDetails component with Navbar, Footer, floating social buttons, and a scroll progress bar.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page that fetches and displays admin-uploaded images in a responsive grid with IntersectionObserver-driven fade-in animations, loading skeletons, and an empty state.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that assembles all site sections—Hero, About, EventDetails, Coordinators, Registration, and Contact—with shared Navbar, Footer, and UI utilities.",
  "frontend/src/pages/NotFoundPage.tsx": "404 error page with a styled alert icon, gradient heading, and a link back to the home page, using decorative background glow orbs.",
  "frontend/src/pages/RegistrationLookupPage.tsx": "A page that allows users to look up their registration status by entering an email address, displaying confirmation details or an error message based on the search result.",
  "frontend/src/pages/RegistrationPage.tsx": "A simple page wrapper that renders the Registration form component along with Navbar, Footer, ScrollProgressBar, and FloatingSocialButtons.",
  "frontend/src/utils/csvExport.ts": "Utility that converts an array of Registration objects into a CSV file and triggers a browser download with a date-stamped filename.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Poppins, Inter), OKLCH-based semantic color tokens, border radii, and a set of custom animations and keyframes.",
  "project_state.json": "Project state metadata file tracking the project name, existing features, pending admin email update requests, and architectural notes for the National Project Expo 2026 admin dashboard."
}