{
  "backend/main.mo": "Main Motoko actor for the project expo app; handles registration submissions, admin-only queries, content management (hero, about, event details, coordinators, contact), and gallery image storage using authorization and blob-storage mixins.",
  "feature_evidence.json": "JSON report mapping implemented feature IDs (page transitions, glow orbs, shimmer cards, typewriter animation, etc.) to their affected source files, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, serving as a reference document for the project's frontend structure and component responsibilities.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property tokens for light and dark themes (colors, radius, chart, sidebar variables) and applies base border and background styles.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'National Level Project Expo 2026', mounting the app at `#root` and loading `src/main.tsx` as an ES module.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all application routes (home, about, event details, registration lookup, gallery, admin login/dashboard) wrapped in a `RootLayout` that applies a `.page-transition` div for fade-in/slide-up animations, with `QueryClientProvider` and `AdminAuthProvider` at the top level.",
  "frontend/src/components/About.tsx": "About section component that displays a description and three feature cards with two drifting glow orbs as background decoration and IntersectionObserver-triggered staggered bounce-in animations on the cards.",
  "frontend/src/components/AdminContentManagement.tsx": "Admin CMS panel with section-specific forms (Hero, About, Event Details, Coordinators, Contact) that fetch and update content via React Query hooks. Includes reusable sub-components like CmsCard, CmsInput, CmsTextarea, and SaveButton.",
  "frontend/src/components/Contact.tsx": "Contact section component that displays address, phone, email, website, and social links fetched from the API with fallback defaults. Includes scroll animations and links to WhatsApp and Instagram.",
  "frontend/src/components/Coordinators.tsx": "Displays faculty and student coordinator cards with name, role, phone, and email, fetched from the API with hardcoded defaults as fallback. Each card shows initials-based avatar and hover animations.",
  "frontend/src/components/EventDetails.tsx": "Renders event information (date, venue, fee, eligibility, categories, timeline) fetched from the API with default fallback values. Uses IntersectionObserver to trigger bounce-in animations on scroll.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Fixed floating action buttons for Instagram and WhatsApp links positioned at the bottom-right of the screen. Each button shows a tooltip on hover with smooth scale and shadow transitions.",
  "frontend/src/components/Footer.tsx": "Site footer with branding, quick navigation links, and event info columns, plus a scroll-to-top button that appears after scrolling 500px. Includes a bottom bar with copyright and attribution.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying event title, tagline, countdown timer, animated registration count, and a typewriter text effect, pulling content from backend queries.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll-aware styling, active link highlighting, and a collapsible mobile menu using TanStack Router links.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the admin login page using the AdminAuthContext.",
  "frontend/src/components/Registration.tsx": "Project expo registration form with react-hook-form, category selection, a Google Form CTA, and a success dialog showing the registration ID after submission.",
  "frontend/src/context/AdminAuthContext.tsx": "React context providing admin authentication state (login/logout) persisted via sessionStorage for the duration of the browser session.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout flow, and exposes identity state and status flags via React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for all backend interactions including fetching/submitting/updating/deleting registrations, verifying admin credentials, and managing CMS content.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook that uses IntersectionObserver to track when an element enters the viewport, returning a ref and a boolean `isVisible` state with configurable threshold, rootMargin, and triggerOnce options.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for the design system, and declares keyframe animations for page transitions, drifting glow orbs, and shimmer card effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Simple page component that composes the Navbar, About section, Footer, and FloatingSocialButtons into the About page layout.",
  "frontend/src/pages/AdminDashboard.tsx": "Protected admin dashboard page with tabs for managing registrations (search, delete), gallery images (upload, delete), and content sections, plus analytics summary cards showing counts.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with an email/password form that verifies credentials against the backend and redirects to the dashboard on success, with error handling and a password visibility toggle.",
  "frontend/src/pages/EventDetailsPage.tsx": "Simple page component that composes the Navbar, EventDetails section, Footer, and FloatingSocialButtons into the Event Details page layout.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page that fetches and displays uploaded images in an animated, scroll-triggered grid with skeleton loading states, sorted by upload date descending.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that assembles all primary sections (Hero, About, Coordinators, Registration, Contact) along with Navbar, Footer, and FloatingSocialButtons.",
  "frontend/src/pages/RegistrationLookupPage.tsx": "Page that allows users to look up their event registration details by entering their email address, displaying the matched registration record or an appropriate not-found message.",
  "frontend/src/utils/csvExport.ts": "Exports an array of Registration objects to a CSV file by formatting fields, escaping special characters, and triggering a browser download with a date-stamped filename.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens, border radius, accordion keyframes, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 43) for the National Level Project Expo 2026 site, documenting architecture decisions, existing features, and known issues such as admin login failures and dashboard data not loading."
}