{
  "backend/main.mo": "Main Motoko actor for the project expo backend, handling registration CRUD, admin-only access control, and CMS content management (hero, about, event details, coordinators, contact) with role-based authorization via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report confirming that AdminLogin.tsx was updated to submit the password without trimming/transformation and to pre-fill the email field with athiakash1977@gmail.com.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering pages, components, hooks, and routing for the project expo app.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML shell for the React SPA, setting the page title to 'National Level Project Expo 2026' and mounting the app at the #root div via main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for home, about, event-details, check-registration, admin login, and protected admin dashboard, all wrapped in AdminAuthProvider.",
  "frontend/src/components/About.tsx": "About section component that fetches CMS content via useGetAboutContent, falling back to hardcoded defaults for the description and three feature cards, with scroll-triggered animations.",
  "frontend/src/components/AdminContentManagement.tsx": "Admin CMS panel component with sub-sections for editing Hero, About, Event Details, Coordinators, and Contact content, using shared form primitives and React Query mutation hooks with toast feedback.",
  "frontend/src/components/Contact.tsx": "Renders the Contact section with college address, phone, email, website, and social media links, fetching dynamic content via `useGetContactContent` and falling back to defaults.",
  "frontend/src/components/Coordinators.tsx": "Displays faculty and student coordinator cards with avatar initials, phone, and email, fetching data via `useGetCoordinatorsContent` with hardcoded defaults as fallback.",
  "frontend/src/components/EventDetails.tsx": "Shows event details including date, venue, fee, eligibility, project categories, and an animated timeline, with content fetched from `useGetEventDetailsContent` and default fallbacks.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, event info, copyright, and a scroll-to-top button that appears after scrolling 500px.",
  "frontend/src/components/Hero.tsx": "Renders the hero section with a live countdown timer, registration count, event title/tagline fetched via `useGetHeroContent`, animated particles, and scroll-to-section buttons.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll progress indicator, active route highlighting, page nav links, and home-page-only anchor links with smooth scrolling.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the admin login page using the AdminAuthContext.",
  "frontend/src/components/Registration.tsx": "Team registration form component with react-hook-form validation, category selection, a Google Form CTA, and a success dialog displaying the registration ID.",
  "frontend/src/context/AdminAuthContext.tsx": "React context providing admin authentication state (login/logout) persisted via sessionStorage.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor (anonymous or authenticated) using TanStack Query, reinitializing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication via DFINITY's AuthClient, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for CRUD operations on registrations, admin credential verification, and fetching CMS content sections from the ICP backend actor.",
  "frontend/src/hooks/useScrollAnimation.ts": "Hook that uses IntersectionObserver to track element visibility for triggering scroll-based animations, with configurable threshold and trigger-once behavior.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins font, sets up Tailwind layers, defines a dark green-themed design system with CSS variables, and provides custom utility classes, component styles, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Simple page component that composes the Navbar, About section, and Footer into the About page layout.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with a searchable, paginated table of registrations supporting view, edit, and delete operations, plus a content management tab.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with an email/password form that verifies credentials against the backend and redirects to the dashboard on success.",
  "frontend/src/pages/EventDetailsPage.tsx": "Simple page component that composes the Navbar, EventDetails section, and Footer into the Event Details page layout.",
  "frontend/src/pages/HomePage.tsx": "Home page that assembles the Navbar, Hero, Coordinators, Registration, Contact, and Footer components.",
  "frontend/src/pages/RegistrationLookupPage.tsx": "Page that allows users to look up their registration details by entering their email address, displaying the result in a styled card.",
  "frontend/src/utils/csvExport.ts": "Utility that converts an array of Registration objects into a CSV file and triggers a browser download with a date-stamped filename.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based color tokens (primary, secondary, sidebar, chart, etc.), border radius variables, accordion keyframe animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking file (version 27) describing the 'National Level Project Expo 2026' website's architecture, features, known issues (admin login password mismatch), and implementation details including Firebase auth, green glassmorphism theme, and multi-page routing."
}