{
  "backend/main.mo": "Main Motoko actor for the hackathon app; handles registrations, user profiles, CMS content (hero, about, event details, coordinators, contact), gallery images, and admin access control using mixed-in authorization and blob storage modules.",
  "feature_evidence.json": "Feature evidence report mapping two routing-fix features (TanStack Router hash-based routing and IC asset canister client-side routing support) to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated text file containing short summaries of each frontend source file, describing the purpose and key functionality of pages, components, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'National Level Project Expo 2026', mounting the app at `#root` and loading `src/main.tsx` as an ES module.",
  "frontend/src/App.tsx": "TanStack Router setup using hash-based history for IC asset canister compatibility; defines all page routes (home, about, event-details, registration, gallery, check-registration, admin, admin/dashboard) and wraps the app with QueryClientProvider and AdminAuthProvider.",
  "frontend/src/components/About.tsx": "About section component that fetches CMS content via `useGetAboutContent`, renders a section description and three feature cards with IntersectionObserver-triggered staggered bounce-in animations and drifting glow orbs.",
  "frontend/src/components/AdminContentManagement.tsx": "Admin panel component with accordion sections for editing Hero, About, Event Details, Coordinators, and Contact content, each using React Query hooks for fetching and updating data via forms.",
  "frontend/src/components/Contact.tsx": "Contact section component that displays address, phone, email, website, and social links (WhatsApp/Instagram) with intersection-observer-based scroll animations and data fetched via useGetContactContent.",
  "frontend/src/components/Coordinators.tsx": "Coordinators section that renders faculty and student coordinator cards with contact info, scroll-triggered animations, and data fetched via useGetCoordinatorsContent with fallback defaults.",
  "frontend/src/components/EventDetails.tsx": "Event details section displaying info cards (date, venue, fee, eligibility), project categories, and a timeline, with scroll-triggered animations and data from useGetEventDetailsContent.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Fixed floating action buttons in the bottom-right corner linking to WhatsApp and Instagram with hover tooltip labels.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick navigation links, and social media icons (WhatsApp/Instagram), plus a scroll-to-top button and a gradient top border.",
  "frontend/src/components/Hero.tsx": "Hero section component featuring a typewriter text animation, a live countdown timer to the event date, parallax scroll effect, and displays dynamic hero content and registration count fetched via React Query hooks.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll-aware background blur, active link highlighting, a mobile hamburger menu, and a 'Register Now' CTA button linking to the registration page.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the /admin login page using the AdminAuthContext, otherwise renders the wrapped children.",
  "frontend/src/components/Registration.tsx": "Registration section with an inline form for submitting event registrations (including project details and category), a success modal displaying the registration ID, and a UPI payment QR code section.",
  "frontend/src/components/ScrollProgressBar.tsx": "Fixed top progress bar that tracks and visually displays the user's scroll position as a percentage of the total page height.",
  "frontend/src/context/AdminAuthContext.tsx": "React context providing admin authentication state backed by sessionStorage, with login and logout functions exposed via the useAdminAuth hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with an anonymous or authenticated identity and an admin token from URL params, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication via DFINITY's AuthClient, managing login status, identity persistence, and exposing login/clear functions through a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including registration CRUD, admin verification, hero/about/event/gallery content fetching and updating via the ICP actor.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to trigger fade-in or slide-up CSS animations when an element scrolls into view.",
  "frontend/src/index.css": "Global stylesheet importing Poppins/Inter fonts, defining CSS custom properties for the green-themed dark design system, and declaring all keyframe animations used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Standalone page that renders the About section with Navbar, Footer, floating social buttons, and a scroll progress bar.",
  "frontend/src/pages/AdminDashboard.tsx": "Protected admin dashboard page with tabs for managing registrations (search, delete, CSV export) and gallery images (upload, delete), plus a content management tab.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that verifies credentials against the ICP backend and redirects to the dashboard on success.",
  "frontend/src/pages/EventDetailsPage.tsx": "Standalone page that renders the EventDetails section with Navbar, Footer, floating social buttons, and a scroll progress bar.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page that fetches and displays images in a responsive grid with intersection-observer-based fade-in animations and loading skeletons.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes all section components (Hero, About, EventDetails, Coordinators, Registration, Contact) with Navbar, Footer, and UI utilities.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a styled 404 Not Found page with a green-themed design, an alert icon, and a link back to the home route.",
  "frontend/src/pages/RegistrationLookupPage.tsx": "Provides a page where users can enter their email to look up and verify their event registration status, displaying found or not-found results.",
  "frontend/src/pages/RegistrationPage.tsx": "Wraps the Registration component in a full-page layout with Navbar, Footer, scroll progress bar, and floating social buttons.",
  "frontend/src/utils/csvExport.ts": "Exports an array of Registration objects to a downloadable CSV file with properly escaped fields and a formatted timestamp.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, border radii, and named animations/keyframes for the app's green-themed UI.",
  "project_state.json": "Tracks project state at version 3, recording two existing fix features aimed at resolving a 'Not Found' routing error in the deployed Internet Computer frontend."
}