{
  "backend/main.mo": "Main Motoko actor for the project expo app; handles registrations, user profiles, CMS content (hero, about, event details, coordinators, contact), and gallery images, with admin-only access control via included authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping a single revert/restore feature to its associated frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key features of every page, component, and hook in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes (colors, radius, sidebar, charts) and applying base border and background styles.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'National Level Project Expo 2026' and mounting the app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "TanStack Router and React Query setup defining all application routes (home, gallery, registration lookup, admin login, admin dashboard) wrapped in AdminAuthProvider, with a RootLayout that applies a page-transition CSS class on route changes.",
  "frontend/src/components/About.tsx": "About section component that fetches CMS content via React Query, displays a description and up to three feature cards with IntersectionObserver-triggered staggered bounce-in animations and two drifting background orbs.",
  "frontend/src/components/AdminContentManagement.tsx": "Standalone CMS component with accordion-organized sections for editing Hero, About, Event Details, Coordinators, and Contact content, each with fetch/save mutations and toast feedback using shadcn-ui form controls.",
  "frontend/src/components/Contact.tsx": "Renders the Contact section with address, phone, email, website, social links, WhatsApp/Instagram quick-action buttons, and an embedded Google Map, pulling dynamic content from a query hook with fallback defaults.",
  "frontend/src/components/Coordinators.tsx": "Displays faculty and student coordinator cards with name, role, phone, and email, using IntersectionObserver for scroll-triggered bounce-in animations and falling back to default data if none is fetched.",
  "frontend/src/components/EventDetails.tsx": "Shows event info cards (date, venue, fee, eligibility), project categories, and a timeline of milestones with scroll-triggered animations, using fetched content or built-in defaults.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Renders fixed floating action buttons for Instagram and WhatsApp with hover tooltips and scale/shadow effects.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with branding, quick-nav links, event info, a scroll-to-top button, and a copyright bar.",
  "frontend/src/components/Hero.tsx": "Renders the full-screen hero section with a parallax background, typewriter tagline animation, count-up registration counter, and CTA buttons, using fetched hero content with fallback defaults.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll-aware styling, smooth scrolling to page sections, and active link highlighting for both desktop and mobile layouts.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the admin login page using the AdminAuthContext.",
  "frontend/src/components/Registration.tsx": "Registration form component for the expo that supports both an embedded Google Form iframe and a native form submission via a backend mutation hook.",
  "frontend/src/context/AdminAuthContext.tsx": "React context providing admin authentication state persisted in sessionStorage, with login and logout functions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor using TanStack Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication via DFINITY's AuthClient, exposing identity state, login/logout functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for all backend interactions including registrations, admin verification, and CMS content (hero, about, event details, gallery, etc.).",
  "frontend/src/hooks/useScrollAnimation.ts": "Hook that uses IntersectionObserver to track when a referenced element enters the viewport, returning a visibility flag for scroll-triggered animations.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, defines CSS custom properties for the dark green-themed design system, and declares keyframe animations for page transitions, drifting glow orbs, and shimmer effects.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Simple page component that composes Navbar, About section, Footer, and FloatingSocialButtons into a standalone About page.",
  "frontend/src/pages/AdminDashboard.tsx": "Protected admin dashboard page with tabs for managing registrations (search, delete, CSV export) and gallery images (upload, delete), using React Query hooks to interact with the backend canister.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that verifies credentials against the backend canister and redirects to the dashboard on success, displaying appropriate error messages on failure.",
  "frontend/src/pages/EventDetailsPage.tsx": "Simple page component that composes Navbar, EventDetails section, Footer, and FloatingSocialButtons into a standalone Event Details page.",
  "frontend/src/pages/GalleryPage.tsx": "Gallery page that fetches images from the backend and displays them in a responsive grid with intersection-observer-driven fade-in animations and a hover overlay showing the image title.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that assembles all major sections (Hero, About, EventDetails, Coordinators, Registration, Contact) along with Navbar, a footer, and FloatingSocialButtons.",
  "frontend/src/pages/RegistrationLookupPage.tsx": "Page allowing users to look up their registration status by email, displaying confirmed registration details or a not-found message based on the backend query result.",
  "frontend/src/utils/csvExport.ts": "Exports an array of Registration objects to a CSV file by formatting fields, escaping special characters, and triggering a browser download with a date-stamped filename.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL parameters from both query strings and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens, border radii, accordion keyframe animations, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project metadata and feature state, recording a single completed feature to revert the application to its last known stable frontend and backend version."
}