{
  "backend/main.mo": "Motoko actor implementing the backend for a project expo registration system, with public endpoints for submitting and counting registrations and admin-only endpoints for listing, deleting, and updating registrations, plus user profile management and hardcoded admin credential verification.",
  "feature_evidence.json": "Feature evidence report mapping two planned features—an Edit Registration UI in AdminDashboard and a useUpdateRegistration mutation hook in useQueries.ts—to their target files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of each frontend source file, describing the purpose and key changes of pages, components, hooks, and routing configuration.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines light and dark mode CSS custom properties for the design system's color tokens, radii, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'National Level Project Expo 2026' and mounting the app via the /src/main.tsx module script.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for home, about, event details, registration lookup, admin login, and protected admin dashboard, all wrapped in AdminAuthProvider.",
  "frontend/src/components/About.tsx": "About section component displaying three animated feature cards (Innovation Hub, Inter-College Participation, Certificates & Prizes) with scroll-triggered fade-in animations and glassmorphism styling.",
  "frontend/src/components/Contact.tsx": "Contact section component showing college address, phone, email, and social media links in a two-column glassmorphism layout with scroll-triggered animations.",
  "frontend/src/components/Coordinators.tsx": "Renders a section displaying faculty and student coordinator cards with name, role, phone, and email, using scroll-triggered animations for each card.",
  "frontend/src/components/EventDetails.tsx": "Displays event information (date, venue, fee, eligibility), project categories, and an animated alternating timeline of key registration and expo milestones.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, event info, and a scroll-to-top button that appears after scrolling 500px.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a live countdown timer to the event date, animated particles, and a live registration count fetched via a query hook.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with a scroll progress indicator, page route links, home-page anchor links, and a responsive mobile menu using TanStack Router.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to redirect unauthenticated users to the admin login page based on the AdminAuthContext state.",
  "frontend/src/components/Registration.tsx": "A registration form component for the National Level Project Expo 2026 that collects team details (name, email, college, project info) and submits them via a mutation hook, showing a success dialog with a registration ID on completion.",
  "frontend/src/context/AdminAuthContext.tsx": "Provides a React context for admin authentication state, persisting login status in sessionStorage and exposing login/logout functions.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor using TanStack Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login status, identity persistence, and exposing login/clear functions via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend operations including fetching registration count/list, submitting, updating, deleting registrations, verifying admin credentials, and looking up a registration by email.",
  "frontend/src/hooks/useScrollAnimation.ts": "A custom hook that uses IntersectionObserver to track whether a referenced element is visible in the viewport, enabling scroll-triggered animations.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a dark green-themed design system with CSS custom properties, and adds utility classes, glass-card components, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "A simple page component that composes the Navbar, About section, and Footer into the About page layout.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays a searchable, filterable table of event registrations with support for deleting, editing, and exporting entries to CSV.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with an email/password form that verifies credentials against the backend and redirects to the dashboard on success.",
  "frontend/src/pages/EventDetailsPage.tsx": "Simple page that composes the Navbar, EventDetails, and Footer components to display event detail information.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that assembles the Navbar, Hero, Coordinators, Registration, Contact, and Footer sections.",
  "frontend/src/pages/RegistrationLookupPage.tsx": "Page that allows users to look up their registration details by entering their email address, displaying the result in a structured detail view.",
  "frontend/src/utils/csvExport.ts": "Utility that converts an array of Registration objects into a CSV file and triggers a browser download with a date-stamped filename.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, border radii, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the full project state (version 9) for the 'National Level Project Expo 2026' website, including architectural notes, existing features, known issues, and design specifications like green gradient theme, glassmorphism UI, Firebase auth, and multi-page routing."
}