{
  "backend/main.mo": "Main Internet Computer actor implementing registration submission/retrieval, user profiles, CMS content management (hero, about, event details, coordinators, contact), and gallery storage, with admin-only access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin login, CMS, registrations dashboard, analytics, gallery) to their corresponding source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key functionality of every page, component, and hook in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'National Level Project Expo 2026', mounting the app at `#root` and loading `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "TanStack Router configuration with hash-based history, defining all application routes (home, about, event details, registration, gallery, admin login/dashboard) wrapped in AdminAuthProvider and QueryClientProvider, with ProtectedRoute guarding the admin dashboard.",
  "frontend/src/components/About.tsx": "About section component that fetches CMS content via `useGetAboutContent`, renders a section description and up to three feature cards with IntersectionObserver-triggered staggered bounce-in animations and drifting glow orb backgrounds.",
  "frontend/src/components/AdminContentManagement.tsx": "Admin panel component that provides collapsible section editors for managing all site content (Hero, About, Event Details, Coordinators, Contact) using React Query hooks with save/update functionality and toast notifications.",
  "frontend/src/components/Contact.tsx": "Contact section component that fetches and displays contact info (address, phone, email, website) with animated intersection-observer cards and links to WhatsApp and Instagram.",
  "frontend/src/components/Coordinators.tsx": "Coordinators section component that fetches and renders faculty and student coordinator cards with contact details, animated on scroll into view.",
  "frontend/src/components/EventDetails.tsx": "Event Details section component that fetches and displays event info cards (date, venue, fee, eligibility), project categories, and a timeline of milestones with scroll-triggered animations.",
  "frontend/src/components/FloatingSocialButtons.tsx": "Fixed floating action buttons component that renders WhatsApp and Instagram links in the bottom-right corner with hover tooltips.",
  "frontend/src/components/Footer.tsx": "Site footer component displaying brand info, quick navigation links, and social media icons (WhatsApp, Instagram) with a scroll-to-top button and gradient styling.",
  "frontend/src/components/GalleryManager.tsx": "Admin component for managing gallery images, supporting upload (with title and file preview) and deletion of images via React Query mutations.",
  "frontend/src/components/Hero.tsx": "Hero section component featuring a typewriter text animation, a live countdown timer to the event date, and dynamic stats like registration count fetched from the backend.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll-aware styling, active link highlighting, and a collapsible mobile menu for the IoT Expo site.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the admin login page using the AdminAuthContext.",
  "frontend/src/components/Registration.tsx": "Registration section with an inline form for submitting event registrations, UPI payment info, and a success modal displaying the assigned registration ID.",
  "frontend/src/components/ScrollProgressBar.tsx": "Fixed top progress bar that visually indicates scroll depth on the page using a green gradient.",
  "frontend/src/context/AdminAuthContext.tsx": "Simpler admin auth context that stores a boolean authentication flag in sessionStorage with login/logout helpers, without credential validation.",
  "frontend/src/contexts/AdminAuthContext.tsx": "Admin authentication context that validates hardcoded email/password credentials, persists session state in sessionStorage, and exposes login/logout methods.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control when authenticated and invalidating dependent queries on actor change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including registration CRUD operations and content management (hero, about, event details, etc.) using TanStack Query.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to trigger fade-in or slide-up CSS animations when an element scrolls into view, with configurable delay and threshold.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for the dark green-themed design system, Tailwind imports, scroll animation classes, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Page component that composes the About section with Navbar, Footer, floating social buttons, and a scroll progress bar.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying registration records with search, CSV export, delete, and expandable detail views, plus tabs for gallery and content management.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with email/password form that restricts access to a hardcoded admin email and delegates authentication to the AdminAuthContext.",
  "frontend/src/pages/EventDetailsPage.tsx": "Page component that renders the EventDetails section wrapped with Navbar, Footer, floating social buttons, and a scroll progress bar.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a responsive photo gallery grid with intersection-observer-based fade-in animations, loading skeletons, and an empty state, fetching images via the useGetGalleryImages hook.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes all primary sections (Hero, About, EventDetails, Coordinators, Registration, Contact) along with Navbar, Footer, and UI utilities.",
  "frontend/src/pages/NotFoundPage.tsx": "404 error page with a green-themed design featuring decorative glow orbs, a large '404' heading, and a link back to the home route.",
  "frontend/src/pages/RegistrationLookupPage.tsx": "Allows users to look up their event registration status by email, displaying confirmation details or error states based on the query result.",
  "frontend/src/pages/RegistrationPage.tsx": "Standalone page that wraps the Registration component with Navbar, Footer, scroll progress bar, and floating social buttons.",
  "frontend/src/utils/csvExport.ts": "Exports an array of Registration objects to a downloadable CSV file, handling timestamp formatting and proper CSV escaping.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Poppins, Inter), OKLCH-based semantic color tokens, border radius variables, and a rich set of custom animations and keyframes.",
  "project_state.json": "Tracks project state for the National Project Expo 2026 admin dashboard, including existing features (admin auth, content management, registrations, analytics) and a pending request to activate full admin management for athiakash1977@gmail.com."
}